---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OptionName
source: html/ab222357-9dd8-4521-3679-c4624eec7b58.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OptionName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId OptionName { get; }
```